package project.thread.test;

/**
 *
 * 例子：创建三个窗口买票，总票数为100张，使用实现Runnable接口的方式
 * 存在线程安全问题，待解决
 *
 * 1.问题：买票过程中，出现了重票、错票 --> 出现了线程安全问题
 * 2.问题出现的原因：当某个线程操作车票的过程中，尚未操作完成时，其他线程参与进来，
 *                 也来操作车票。
 * 3.如何解决：当一个线程a在操作ticket(共享数据)的时候，其他线程不能参与进来。
 *            直到线程a操作完ticket(共享数据)时，其他线程才可以开始操作
 *            ticket(共享数据)。这种情况即使线程a出现了阻塞也不能被改变
 * 4.在Java中，我们通过同步机制，来解决线程的安全问题。
 *
 * 方式一：同步代码块
 *
 *        synchronized(同步监视器){
 *            //需要被同步的代码
 *        }
 *        说明：1.操作共享数据的代码，即为需要被同步的代码
 *             2.共享数据：多个线程共同操作的变量。比如：ticket就是共享数据
 *             3.同步监视器；俗称：锁。任何一个类的对象，都可以充当锁
 *               *🔺*要求：多个线程必须要共用同一把锁*🔺*
 *
 *             补充：在实现Runnable接口创建多线程的方式中，我们可以考虑使用
 *                  this充当同步监视器
 *
 *
 * 方式二：同步方法
 *
 * 5.同步的方式，解决了线程的安全问题。 --> 同步的方式的好处
 *   操作同步代码时，只能有一个线程参与，其他线程等待。相当于是一个单线程的过程，
 *      效率低。 ————>同步的方式的局限性
 *
 *
 * @author yuan_zhigang Eamil:3155799044@qq.com
 * @create 2019-11-19 15:30
 */

class WindowRunnable implements Runnable{

    private int ticket = 100;
    Object obj = new Object();

    @Override
    public void run() {

        while (true){
//            synchronized(obj) {
            synchronized(this){
                if (ticket > 0) {

                    try {
                        Thread.sleep(100);
                    } catch (InterruptedException e) {
                        e.printStackTrace();
                    }

                    System.out.println(Thread.currentThread().getName() + ":买票，票号为：" + ticket);

                    ticket--;
                } else {
                    break;
                }
            }
        }
    }
}

public class WindowRunnableTest {
    public static void main(String[] args) {
        WindowRunnable w = new WindowRunnable();

        Thread t1 = new Thread(w);
        Thread t2 = new Thread(w);
        Thread t3 = new Thread(w);

        t1.setName("窗口1");
        t2.setName("窗口2");
        t3.setName("窗口3");

        t1.start();
        t2.start();
        t3.start();

    }
}
